In [7]:
import pandas as pd 
df = pd.read_csv("family.csv")
df

               Name  Age     Persue
0  Mohammad Firdosh   19      Hafiz
1    Mohammad Arman   18     B.tech
2    Mohammad Wasim   17        I.A
3  Reshman Khatoon,   16        B.A
4    Saniya Khatoon   15        B.A
5  Mohammad Faishal   14    Amu 9th
6    Fariya Khatoon   12  7th class
7   Aafreen Khatoon    8  5th class
8           Samreen    8  4th class

In [11]:
df.columns

Index(['Name', 'Age', 'Persue'], dtype='object')

In [19]:
df[['Name','Persue','Age']]

               Name     Persue  Age
0  Mohammad Firdosh      Hafiz   19
1    Mohammad Arman     B.tech   18
2    Mohammad Wasim        I.A   17
3  Reshman Khatoon,        B.A   16
4    Saniya Khatoon        B.A   15
5  Mohammad Faishal    Amu 9th   14
6    Fariya Khatoon  7th class   12
7   Aafreen Khatoon  5th class    8
8           Samreen  4th class    8

In [22]:
# selecting rows by their positions
df.iloc[0:5]

               Name  Age  Persue
0  Mohammad Firdosh   19   Hafiz
1    Mohammad Arman   18  B.tech
2    Mohammad Wasim   17     I.A
3  Reshman Khatoon,   16     B.A
4    Saniya Khatoon   15     B.A

In [27]:
#selecting coloumns by their positions
df.iloc[:,:2]

               Name  Age
0  Mohammad Firdosh   19
1    Mohammad Arman   18
2    Mohammad Wasim   17
3  Reshman Khatoon,   16
4    Saniya Khatoon   15
5  Mohammad Faishal   14
6    Fariya Khatoon   12
7   Aafreen Khatoon    8
8           Samreen    8

In [31]:
# find similar data
df[df['Age']==8]

              Name  Age     Persue
7  Aafreen Khatoon    8  5th class
8          Samreen    8  4th class

In [32]:
df[df['Name']=="Samreen"]

      Name  Age     Persue
8  Samreen    8  4th class

In [7]:
import pandas as pd
median = {
    "Student":["Arman","FaishL","Wasim","Firdosh","tamanna"],
    'Marks':[9700,83,78,86,91],
    "Gender":["male","male","male","male","male"],
    "Subject":["English","English","Physics","Chemistry","English"]
    
}
median_file = pd.DataFrame(median)
median_file

   Student  Marks Gender    Subject
0    Arman   9700   male    English
1   FaishL     83   male    English
2    Wasim     78   male    Physics
3  Firdosh     86   male  Chemistry
4  tamanna     91   male    English

In [9]:
median_file.to_csv("median.csv")

In [10]:
# to read the file illustrate above

file = pd.read_csv("median.csv")

In [11]:
file

   Unnamed: 0  Student  Marks Gender    Subject
0           0    Arman   9700   male    English
1           1   FaishL     83   male    English
2           2    Wasim     78   male    Physics
3           3  Firdosh     86   male  Chemistry
4           4  tamanna     91   male    English

In [18]:
#printing median value
median_data = file["Marks"].median()
print(median_data)

86.0

In [32]:
# caluculating Quantiles. Remember Quantiles are 1/4th of quatiles #quartile is differ
Q1 = file["Marks"].quantile(0.25)
Q2 = file["Marks"].quantile(0.5)
Q3 = file["Marks"].quantile(0.75)
Q4 = file["Marks"].quantile(1)

print("first Quantile",Q1)
print("second Qunti",Q2)
print("third Qunti",Q3)
print("fourth Qunti",Q4)

first Quantile 83.0
second Qunti 86.0
third Qunti 91.0
fourth Qunti 9700.0

In [33]:
obj1 = file["Marks"].max()
obj2 = file["Marks"].min()
print(obj1)
print(obj2)

9700
78

In [34]:
# find range (max - min)
range_data = obj1 - obj2
range_data

9622

In [35]:
# calculating IQR  requires calculating 1st and 3rd quartiled.
IQR = Q3 - Q1
IQR

8.0

In [36]:
# calculating Variance
mean = file["Marks"].mean()
difference = file["Marks"] - mean
squared_difference= difference ** 2
variance = squared_difference.mean()
print(variance)

14793272.239999998

In [37]:
#calculating Variance in other way in short of time
var_data = file['Marks'].var(ddof = 0)
var_data

14793272.239999998

In [40]:
# find mean value
_mean = file["Marks"].mean()
_mean

2007.6

# standard variance

In [41]:
# standard variance
standard_deviation = variance**(1/2)
standard_deviation

3846.202313971536

In [42]:
# calculate variance
var_data = file['Marks'].var(ddof = 0)
var_data

14793272.239999998

In [47]:
#standard deviation equal to root over variance
std = file['Marks'].std(ddof = 0)
std
(file)

   Unnamed: 0  Student  Marks Gender    Subject
0           0    Arman   9700   male    English
1           1   FaishL     83   male    English
2           2    Wasim     78   male    Physics
3           3  Firdosh     86   male  Chemistry
4           4  tamanna     91   male    English

In [51]:
# Frequency Table for Categrical Variable
freq_data = file["Subject"].value_counts() # value_counts(),it's function
freq_data

English      3
Physics      1
Chemistry    1
Name: Subject, dtype: int64

# HISTOGRAM

In [52]:
import pandas as pd

H = pd.read_csv('median.csv')
H

   Unnamed: 0  Student  Marks Gender    Subject
0           0    Arman   9700   male    English
1           1   FaishL     83   male    English
2           2    Wasim     78   male    Physics
3           3  Firdosh     86   male  Chemistry
4           4  tamanna     91   male    English

In [53]:
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
plt.hist=